driver-tests/bpelse/rethrow/RethrowJBI/test/FirstLevelScopeCatch/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:new="http://j2ee.netbeans.org/wsdl/newWSDL">
  <soapenv:Body>
    <new:newWSDLOperation>
      <part1>1stLevelScope</part1>
      <part2>catch</part2>
    </new:newWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>